Documents/ПоступлениеНаРасчетныйСчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Document>
		<Properties>
			<Name>ПоступлениеНаРасчетныйСчет</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетРасчетов</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто2</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ДоговорЗайма</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кратность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоРасчетыПоЗайму</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccountingRegisters/Хозрасчетный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<AccountingRegister>
		<Properties>
			<Name>Хозрасчетный</Name>
			<ChartOfAccounts>ChartOfAccounts.Хозрасчетный</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВалюта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Валютный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

Documents/ПоступлениеНаРасчетныйСчет/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения, Отказ);
	ПодготовитьТаблицыДляДвижений(Ссылка, ДополнительныеСвойства, РежимПроведения, Отказ);
	СформироватьДвиженияВРегистры(ДополнительныеСвойства, Движения, Отказ);
	
	СформироватьДвиженияХозрасчетный(ДополнительныеСвойства, Движения, Отказ)
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения, Отказ) Экспорт 
	
	ДополнительныеСвойства.Вставить("ВалютаРегУчета", Константы.ВалютаРегламентированногоУчета.Получить());
	
КонецПроцедуры

Процедура ПодготовитьТаблицыДляДвижений(Ссылка, ДополнительныеСвойства, РежимПроведения, Отказ) Экспорт

КонецПроцедуры

Процедура СформироватьДвиженияВРегистры(ДополнительныеСвойства, Движения, Отказ) Экспорт

КонецПроцедуры

Процедура СформироватьДвиженияХозрасчетный(ДополнительныеСвойства, Движения, Отказ) Экспорт 
	Хозрасчетный = Движения.Хозрасчетный;

	//тут в БУ модуль по определению счета, упростим
	СчетБанк = ПланыСчетов.Хозрасчетный.РасчетныеСчета; 
	Если ДополнительныеСвойства.ВалютаРегУчета <> Валюта Тогда 
		СчетБанк = ПланыСчетов.Хозрасчетный.ВалютныеСчета;
	КонецЕсли;                                            
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Документ.Дата КАК Период,
		|	Документ.Организация КАК Организация,
		|	ВЫБОР
		|		КОГДА Документ.Валюта <> &ВалютаРегУчета
		|			ТОГДА Документ.Валюта
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
		|	КОНЕЦ КАК ВалютаДт,
		|	ВЫБОР
		|		КОГДА Документ.Валюта <> &ВалютаРегУчета
		|			ТОГДА Документ.Валюта
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
		|	КОНЕЦ КАК ВалютаКт,
		|	&СчетБанк КАК СчетДт,
		|	Документ.СчетОрганизации КАК СубконтоДт1,
		|	Документ.СчетРасчетов КАК СчетКт,
		|	Документ.Контрагент КАК СубконтоКт1,
		|	Документ.Субконто2 КАК СубконтоКт2,
		|	ВЫБОР
		|		КОГДА Документ.Валюта = &ВалютаРегУчета
		|			ТОГДА Документ.Сумма
		|		ИНАЧЕ Документ.Сумма * Документ.Курс * Документ.Кратность
		|	КОНЕЦ КАК Сумма,
		|	ВЫБОР
		|		КОГДА Документ.Валюта = &ВалютаРегУчета
		|			ТОГДА 0
		|		ИНАЧЕ Документ.Сумма
		|	КОНЕЦ КАК СуммаВал
		|ИЗ
		|	Документ.ПоступлениеНаРасчетныйСчет КАК Документ
		|ГДЕ
		|	Документ.Ссылка = &Ссылка
		|	И Документ.ЭтоРасчетыПоЗайму = ИСТИНА";
	//
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("СчетБанк", СчетБанк);
	Запрос.УстановитьПараметр("ВалютаРегУчета", ДополнительныеСвойства.ВалютаРегУчета);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВДЗ = РезультатЗапроса.Выбрать();
	
	Пока ВДЗ.Следующий() Цикл
		СтрД = Хозрасчетный.Добавить();
		ЗаполнитьЗначенияСвойств(СтрД, ВДЗ);
		
		//в БУХ ТУТ универсальная обратка установки собконто. Имитируем
		Для Индекс = 1 ПО 3 Цикл
			ЗначениеСубконто = Неопределено;
			Если РезультатЗапроса.Колонки.Найти("СубконтоДт" + Индекс) <> Неопределено Тогда
				ЗначениеСубконто = ВДЗ["СубконтоДт" + Индекс];		
			КонецЕсли; 
			Если ЗначениеСубконто = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			Для каждого Субконто Из СтрД.СчетДт.ВидыСубконто Цикл 
				
				Если Субконто.ВидСубконто.ТипЗначения.СодержитТип(ТипЗнч(ЗначениеСубконто)) Тогда
					СтрД.СубконтоДт.Вставить(Субконто.ВидСубконто, ЗначениеСубконто)	
				КонецЕсли;
			КонецЦикла;			
	
		КонецЦикла;	
		Для Индекс = 1 ПО 3 Цикл
			ЗначениеСубконто = Неопределено;
			Если РезультатЗапроса.Колонки.Найти("СубконтоКт" + Индекс) <> Неопределено Тогда
				ЗначениеСубконто = ВДЗ["СубконтоКт" + Индекс];		
			КонецЕсли;  
			Если ЗначениеСубконто = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			Для каждого Субконто Из СтрД.СчетКт.ВидыСубконто Цикл 
				
				Если Субконто.ВидСубконто.ТипЗначения.СодержитТип(ТипЗнч(ЗначениеСубконто)) Тогда
					СтрД.СубконтоКт.Вставить(Субконто.ВидСубконто, ЗначениеСубконто)	
				КонецЕсли;
			КонецЦикла;			
		КонецЦикла;

	КонецЦикла;
	
	Хозрасчетный.Записывать = Истина;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
